import random as rnd

print(
    """
      _  _     __     ____    _  _    ____    _  _
     ( \/ )   / _\   (_  _)  / )( \  (  __)  ( \/ )
     / \/ \  /    \    )(    \ \/ /   ) _)    )  /
     \_)(_/  \_/\_/   (__)    \__/   (____)  (__/
     
     
    ___________ ___________   ____________________
    \__    ___/ \_   _____/  /   _____/\__    ___/
      |    |     |    __)_   \_____  \   |    |   
      |    |     |        \  /        \  |    |   
      |____|    /_______  / /_______  /  |____|   
                        \/          \/            

    Периодическая табилица Менделеева из первых 27 химических элементов
    В тесте будут выбраны 10 случайных, на которые вы должны будете дать ответ на русском (регистр не важен)
    """
)

el = {
    "N": "азот",
    "Al": "алюминий",
    "Ba": "барий",
    "B": "бор",
    "H": "водород",
    "Fe": "железо",
    "Au": "золото",
    "I": "иод",
    "K": "калий",
    "Ca": "кальций",
    "O": "кислород",
    "Si": "кремний",
    "Mg": "магний",
    "Mn": "марганец",
    "Cu": "медь",
    "As": "мышьяк",
    "Na": "натрий",
    "Sn": "олово",
    "Hg": "ртуть",
    "Pb": "свинец",
    "S": "сера",
    "Ag": "серебро",
    "C": "углерод",
    "P": "фосфор",
    "F": "фтор",
    "Cl": "хлор",
    "Zn": "цинк"
}

keys = list(el.keys())
rnd.shuffle(keys)

result = 0

for i in range(10):
    inp = input(f"Что такое {keys[i]}? ")
    if inp.casefold() == el[keys[i]].casefold():
        result += 1

print(f"Ваш результат: {result / 10 * 100}% ({result} из 10)")
