import random as rnd

print(
    """
    ___________ ___________   ____________________
    \__    ___/ \_   _____/  /   _____/\__    ___/
      |    |     |    __)_   \_____  \   |    |   
      |    |     |        \  /        \  |    |   
      |____|    /_______  / /_______  /  |____|   
                        \/          \/            

    Периодическая табилица Менделеева из первых 27 химических элементов
    В тесте будут выбраны 10 случайных, на которые вы должны будете дать ответ на русском (регистр не важен)
    """
)

el = {
    "N": "азот",
    "Al": "алюминий",
    "Ba": "барий",
    "B": "бор",
    "H": "водород",
    "Fe": "железо",
    "Au": "золото",
    "I": "иод",
    "K": "калий",
    "Ca": "кальций",
    "O": "кислород",
    "Si": "кремний",
    "Mg": "магний",
    "Mn": "марганец",
    "Cu": "медь",
    "As": "мышьяк",
    "Na": "натрий",
    "Sn": "олово",
    "Hg": "ртуть",
    "Pb": "свинец",
    "S": "сера",
    "Ag": "серебро",
    "C": "углерод",
    "P": "фосфор",
    "F": "фтор",
    "Cl": "хлор",
    "Zn": "цинк"
}

keys = list(el.keys())
rnd.shuffle(keys)

result = 0
wrong_answered = {}

for i in range(10):
    inp = input(f"Что такое {keys[i]}? ")
    if inp.casefold() == el[keys[i]].casefold():
        result += 1
    else:
        wrong_answered[keys[i]] = inp

print(f"Ваш результат: {result / 10 * 100}% ({result} из 10)")

if result != 10:
    print()
    print("Неправильные ответы: ")
    for key in wrong_answered.keys():
        print(f"{key} - {wrong_answered[key]} (Правильный ответ - {el[key]})")

last = input()
